Revit API Introduction Labs
Lab1_1_HelloWorld.Execute Method
 The one and only method required by the IExternalCommand interface, the main entry point for every external command.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public Result Execute(
	ExternalCommandData commandData,
	ref string message,
	ElementSet elements
)
Visual Basic (Declaration)
Public Function Execute ( _
	commandData As ExternalCommandData, _
	ByRef message As String, _
	elements As ElementSet _
) As Result
Visual C++
public:
virtual Result Execute(
	ExternalCommandData^ commandData,
	String^% message,
	ElementSet^ elements
) sealed
Parameters
commandData
Type: ExternalCommandData
Input argument providing access to the Revit application and its documents and their properties.
message
Type: System.String
Return argument to display a message to the user in case of error if Result is not Succeeded.
elements
Type: ElementSet
Return argument to highlight elements on the graphics screen if Result is not Succeeded.
Return Value
Cancelled, Failed or Succeeded Result code.
Implements
IExternalCommandExecute(ExternalCommandData, String, ElementSet)
See Also
Lab1_1_HelloWorld Class
Labs Namespace